# Concatenating Data

### Combining Data

In [6]:
#tips1 dan tips2
import pandas as pd
df_tips1 = pd.read_csv('tips1.csv')
df_tips2 = pd.read_csv('tips2.csv')

In [13]:
concatenated = pd.concat([df_tips1, df_tips2])
concatenated.tail()

     total_bill   tip     sex smoker   day    time  size
190       29.03  5.92    Male     No   Sat  Dinner     3
191       27.18  2.00  Female    Yes   Sat  Dinner     2
192       22.67  2.00    Male    Yes   Sat  Dinner     2
193       17.82  1.75    Male     No   Sat  Dinner     2
194       18.78  3.00  Female     No  Thur  Dinner     2

In [16]:
concatenated = concatenated.loc[0,:]
concatenated

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
0       18.04  3.00    Male     No  Sun  Dinner     2

### ignore index

In [20]:
concatenated2 = pd.concat([df_tips1, df_tips2], 
                         ignore_index=True)
concatenated2.loc[0:4,:]

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

# Finding and concatenating data

## Concatenating many files

In [22]:
import glob

In [23]:
csv_files = glob.glob('concat/*.csv')

In [24]:
csv_files

['concat/tip3.csv', 'concat/tip1.csv', 'concat/tip2.csv']

## Using loops

In [25]:
#menyimpan data csv dalam list
list_data = []

In [27]:
for filename in csv_files:
    data = pd.read_csv(filename)
    list_data.append(data)

In [34]:
#concat list
tip_concat = pd.concat(list_data)
tip_concat.head()

   day  sex  size smoker    time  tip  total_bill
0  Sun  NaN   2.0    NaN  Dinner  NaN         NaN
1  Sun  NaN   3.0    NaN  Dinner  NaN         NaN
2  Sun  NaN   3.0    NaN  Dinner  NaN         NaN
3  Sun  NaN   2.0    NaN  Dinner  NaN         NaN
4  Sun  NaN   4.0    NaN  Dinner  NaN         NaN

## Merging Data

seperti join pada SQL

In [35]:
state_pop = pd.read_csv('state1.csv')
state_code = pd.read_csv('state2.csv')

One-to-one merges

In [38]:
pd.merge(left=state_pop, right=state_code, 
         on=None, left_on='state', right_on='name')

        state  Population_2016        name ANSI
0  California         39250017  California   CA
1       Texas         27862596       Texas   TX
2     Florida         20612439     Florida   FL
3    New York         19745289    New York   NY

Many-to-one / One-to-many merges

In [40]:
state_city = pd.read_csv('state3.csv')

In [ ]:
pd.merge(left=state_code, right= )